Repository: FoodStandardsAgency/myhaccp
Catalog: web/sites/all/translations/menu.*.po
Languages: cy

# item:1209:title
source: External links
cy: Dolenni allanol

# item:15:title
source: Log out
cy: Allgofnodi

# item:1726:title
source: Updates
cy: Diweddariadau

# item:20:title
source: Request new password
cy: Cais am gyfrinair newydd

# item:218:title
source: Home
cy: Hafan

# item:2:title
source: User account
cy: Cyfrif y defnyddiwr

# item:363:title
source: MyHACCP Web Tool
cy: Adnodd MyHACCP

# item:375:title
source: Register
cy: Cofrestru

# item:376:title
source: Log in
cy: Mewngofnodi

# item:391:title
source: Help
cy: Cymorth

# item:429:title
source: Preparatory Stage A: Prerequisite food hygiene requirements
cy: Cam Paratoi A: Gofynion hylendid bwyd hanfodol

# item:439:title
source: Preparatory Stage B: Obtain Management Commitment
cy: Cam Paratoi B: Cael ymrwymiad gan y rheolwyr

# item:440:title
source: Preparatory Stage C: Scope of the study
cy: Cam Paratoi C: Diffinio cwmpas yr astudiaeth

# item:441:title
source: Principle 1.1: Identify and list potential hazards
cy: Egwyddor 1.1: Pennu a rhestru peryglon posibl

# item:442:title
source: Principle 1.2: Conduct a hazard analysis
cy: Egwyddor 1.2: Dadansoddi'r peryglon

# item:443:title
source: Preparatory Stage E: Describe the product
cy: Cam Paratoi E: Disgrifio'r cynnyrch

# item:444:title
source: Preparatory Stage F: Identify intended use of the product
cy: Cam Paratoi F: Pennu defnydd arfaethedig y cynnyrch

# item:445:title
source: Preparatory Stage G: Construct a flow diagram
cy: Cam Paratoi G: Llunio diagram llif

# item:452:title
source: Preparatory Stage D: Select the HACCP team
cy: Cam Paratoi D: Dewis y tîm HACCP

# item:453:title
source: Preparatory Stage H: Confirmation of flow diagram
cy: Cam Paratoi H: Cadarnhau'r diagram llif ar y safle

# item:456:title
source: HACCP Principles
cy: Egwyddorion

# item:457:title
source: Preparatory Stages
cy: Camau Paratoi

# item:458:title
source: Principle 1.3: Specify the control measures for each hazard
cy: Egwyddor 1.3: Pennu'r mesurau rheoli ar gyfer pob perygl

# item:459:title
source: Principle 2: Determine the Critical Control Points (CCPs)
cy: Egwyddor 2.1: Pennu'r Pwyntiau Rheoli Critigol

# item:479:title
source: Principle 3: Establish the Critical Limits
cy: Egwyddor 3: Pennu'r terfynau critigol

# item:480:title
source: Principle 4: Establish a Monitoring System
cy: Egwyddor 4: Llunio system fonitro ar gyfer pob Pwynt Rheoli Critigol

# item:481:title
source: Principle 5: Establish a Corrective Action Plan
cy: Egwyddor 5: Llunio cynllun camau unioni

# item:482:title
source: Principle 6: Verification
cy: Egwyddor 6: Gwirio

# item:483:title
source: Principle 7: Establish documentation and record keeping
cy: Egwyddor 7: Cadw dogfennau a chofnodion

# item:529:title
source: Glossary
cy: Geirfa

# item:566:title
source: Introduction to MyHACCP
cy: Cyflwyniad

# item:580:title
source: FAQ
cy: Cwestiynau cyffredin

# item:759:description
source: FAQ
cy: Cwestiynau cyffredin

# item:759:title
source: FAQ
cy: Cwestiynau cyffredin

# item:760:description
source: Help and guidance for the MyHACCP tool
cy: Cymorth a chanllawiau ar gyfer defnyddio MyHACCP

# item:760:title
source: Help
cy: Cymorth

# item:761:title
source: Contact us
cy: Cysylltu â ni

# item:763:title
source: Copyright
cy: Hawlfraint

# item:764:title
source: Get alerts
cy: Tanysgrifio i rybuddion

# item:765:title
source: Complaints procedure
cy: Gweithdrefn gwyno

# item:766:title
source: Freedom of Information
cy: Rhyddid Gwybodaeth

# item:767:title
source: Privacy
cy: Preifatrwydd

# item:768:title
source: Cookies
cy: Cwcis

# item:769:title
source: FSA Terms and Conditions
cy: Telerau ac Amodau'r ASB

# item:770:title
source: Website policies
cy: Polisïau'r wefan

# item:771:title
source: Feedback
cy: Adborth

# item:775:title
source: Supported browsers
cy: Porwyr priodol

# item:777:title
source: Resources
cy: Adnoddau

# item:780:title
source: MyHACCP Terms and Conditions
cy: Telerau ac Amodau MyHACCP

# item:793:title
source: Business size by type
cy: Maint y busnes yn ôl math

# menu:main-menu:title
source: Main menu
cy: Prif ddewislen
